# Microsoft Movie Analysis

**Author:** [Gustavo Villagrana](mailto:gusvilla303@gmail.com)
***

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Microsoft-Movie-Analysis" data-toc-modified-id="Microsoft-Movie-Analysis-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Microsoft Movie Analysis</a></span><ul class="toc-item"><li><span><a href="#Overview" data-toc-modified-id="Overview-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Overview</a></span></li><li><span><a href="#Business-Problem" data-toc-modified-id="Business-Problem-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Business Problem</a></span></li><li><span><a href="#Data-Understanding" data-toc-modified-id="Data-Understanding-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Data Understanding</a></span></li><li><span><a href="#Data-Preparation" data-toc-modified-id="Data-Preparation-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Data Preparation</a></span></li><li><span><a href="#Data-Modeling" data-toc-modified-id="Data-Modeling-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Data Modeling</a></span></li><li><span><a href="#Evaluation" data-toc-modified-id="Evaluation-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Evaluation</a></span></li><li><span><a href="#Conclusions" data-toc-modified-id="Conclusions-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Conclusions</a></span></li><li><span><a href="#Cleaning-the-Data" data-toc-modified-id="Cleaning-the-Data-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Cleaning the Data</a></span><ul class="toc-item"><li><span><a href="#Title-Basics" data-toc-modified-id="Title-Basics-1.8.1"><span class="toc-item-num">1.8.1&nbsp;&nbsp;</span>Title Basics</a></span></li><li><span><a href="#Title-Ratings" data-toc-modified-id="Title-Ratings-1.8.2"><span class="toc-item-num">1.8.2&nbsp;&nbsp;</span>Title Ratings</a></span></li><li><span><a href="#Movie-Gross-data" data-toc-modified-id="Movie-Gross-data-1.8.3"><span class="toc-item-num">1.8.3&nbsp;&nbsp;</span>Movie Gross data</a></span></li></ul></li><li><span><a href="#Joining-the-Data" data-toc-modified-id="Joining-the-Data-1.9"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>Joining the Data</a></span><ul class="toc-item"><li><span><a href="#Duplicate-Titles-in-Data" data-toc-modified-id="Duplicate-Titles-in-Data-1.9.1"><span class="toc-item-num">1.9.1&nbsp;&nbsp;</span>Duplicate Titles in Data</a></span></li></ul></li><li><span><a href="#Working-with-Genres" data-toc-modified-id="Working-with-Genres-1.10"><span class="toc-item-num">1.10&nbsp;&nbsp;</span>Working with Genres</a></span><ul class="toc-item"><li><span><a href="#Groupby-List-of-Genres" data-toc-modified-id="Groupby-List-of-Genres-1.10.1"><span class="toc-item-num">1.10.1&nbsp;&nbsp;</span>Groupby List of Genres</a></span></li></ul></li></ul></li></ul></div>

## Overview
***
This project analyzes the types of films that are currently doing the best at the box office to help the head of Microsoft's new movie studio decide what type of films to create. Since this is Microsoft's first time creating films, it is critical that the best option is clearly identified in order to optimize this investment opportunity. 



## Business Problem
***
Microsoft wants to create a new movie studio to produce original content but needs help in identifying what type of films are performing the best at the box office. By identifying the best performing films, Microsoft will be able to leverage its investment resources and maximize its profitability. 



## Data Understanding


## Data Preparation


## Data Modeling


## Evaluation


## Conclusions

In [42]:
# Import standard packages
import pandas as pd
pd.options.display.float_format = '{:,.2f}'.format
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## Cleaning the Data

### Title Basics

In [43]:
# Title Basics data

title_basics_df = pd.read_csv('data/imdb.title.basics.csv.gz')
title_basics_df.rename(columns={'tconst': 'movie_id'}, inplace=True)
title_basics_df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.00,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.00,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.00,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,nan,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.00,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.00,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,nan,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,nan,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.00,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,nan,Documentary

In [46]:
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

### Title Ratings

In [47]:
# Understanding the data:
# imdb.title.ratings

title_ratings_df = pd.read_csv('data/imdb.title.ratings.csv.gz')
title_ratings_df.rename(columns={'tconst': 'movie_id'}, inplace=True)
title_ratings_df

         movie_id  averagerating  numvotes
0      tt10356526           8.30        31
1      tt10384606           8.90       559
2       tt1042974           6.40        20
3       tt1043726           4.20     50352
4       tt1060240           6.50        21
...           ...            ...       ...
73851   tt9805820           8.10        25
73852   tt9844256           7.50        24
73853   tt9851050           4.70        14
73854   tt9886934           7.00         5
73855   tt9894098           6.30       128

[73856 rows x 3 columns]

In [48]:
title_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [49]:
# Joined Title Basics df and Title Ratings df ON movie_id

basics_with_ratings_df = title_basics_df.join(title_ratings_df.set_index('movie_id'), on='movie_id')
basics_with_ratings_df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.00,"Action,Crime,Drama",7.00,77.00
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.00,"Biography,Drama",7.20,43.00
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.00,Drama,6.90,"4,517.00"
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,nan,"Comedy,Drama",6.10,13.00
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.00,"Comedy,Drama,Fantasy",6.50,119.00
...,...,...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.00,Drama,nan,nan
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,nan,Documentary,nan,nan
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,nan,Comedy,nan,nan
146142,tt9916730,6 Gunn,6 Gunn,2017,116.00,NaN,nan,nan
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,nan,Documentary,nan,nan

In [50]:
basics_with_ratings_df.rename(columns={'primary_title': 'title'}, inplace=True)
basics_with_ratings_df

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.00,"Action,Crime,Drama",7.00,77.00
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.00,"Biography,Drama",7.20,43.00
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.00,Drama,6.90,"4,517.00"
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,nan,"Comedy,Drama",6.10,13.00
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.00,"Comedy,Drama,Fantasy",6.50,119.00
...,...,...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.00,Drama,nan,nan
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,nan,Documentary,nan,nan
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,nan,Comedy,nan,nan
146142,tt9916730,6 Gunn,6 Gunn,2017,116.00,NaN,nan,nan
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,nan,Documentary,nan,nan

### Movie Gross data

In [51]:
# Movie Gross data

# domestic_gross is FLOAT type but foreign_gross is a STRING type



movie_gross_df = pd.read_csv('data/bom.movie_gross.csv.gz')
movie_gross_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,"415,000,000.00",652000000,2010
1,Alice in Wonderland (2010),BV,"334,200,000.00",691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,"296,000,000.00",664300000,2010
3,Inception,WB,"292,600,000.00",535700000,2010
4,Shrek Forever After,P/DW,"238,700,000.00",513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,"6,200.00",NaN,2018
3383,Edward II (2018 re-release),FM,"4,800.00",NaN,2018
3384,El Pacto,Sony,"2,500.00",NaN,2018
3385,The Swan,Synergetic,"2,400.00",NaN,2018
3386,An Actor Prepares,Grav.,"1,700.00",NaN,2018

In [52]:
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [53]:
movie_gross_sorted_df = movie_gross_df.sort_values(by=['domestic_gross'], ascending=False)
movie_gross_sorted_df

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,"936,700,000.00","1,131.6",2015
3080,Black Panther,BV,"700,100,000.00",646900000,2018
3079,Avengers: Infinity War,BV,"678,800,000.00","1,369.5",2018
1873,Jurassic World,Uni.,"652,300,000.00","1,019.4",2015
727,Marvel's The Avengers,BV,"623,400,000.00",895500000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,nan,49600000,2015
2392,Finding Mr. Right 2,CL,nan,114700000,2016
2468,Solace,LGP,nan,22400000,2016
2595,Viral,W/Dim.,nan,552000,2016
2825,Secret Superstar,NaN,nan,122000000,2017

In [54]:
# Remove commas from df['foreign_gross'] column

movie_gross_sorted_df['foreign_gross'].replace(',','', regex=True, inplace=True)
movie_gross_sorted_df

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,"936,700,000.00",1131.6,2015
3080,Black Panther,BV,"700,100,000.00",646900000,2018
3079,Avengers: Infinity War,BV,"678,800,000.00",1369.5,2018
1873,Jurassic World,Uni.,"652,300,000.00",1019.4,2015
727,Marvel's The Avengers,BV,"623,400,000.00",895500000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,nan,49600000,2015
2392,Finding Mr. Right 2,CL,nan,114700000,2016
2468,Solace,LGP,nan,22400000,2016
2595,Viral,W/Dim.,nan,552000,2016
2825,Secret Superstar,NaN,nan,122000000,2017

In [55]:
movie_gross_sorted_df['foreign_gross'] = movie_gross_sorted_df['foreign_gross'].astype(float)
movie_gross_sorted_df

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,"936,700,000.00","1,131.60",2015
3080,Black Panther,BV,"700,100,000.00","646,900,000.00",2018
3079,Avengers: Infinity War,BV,"678,800,000.00","1,369.50",2018
1873,Jurassic World,Uni.,"652,300,000.00","1,019.40",2015
727,Marvel's The Avengers,BV,"623,400,000.00","895,500,000.00",2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,nan,"49,600,000.00",2015
2392,Finding Mr. Right 2,CL,nan,"114,700,000.00",2016
2468,Solace,LGP,nan,"22,400,000.00",2016
2595,Viral,W/Dim.,nan,"552,000.00",2016
2825,Secret Superstar,NaN,nan,"122,000,000.00",2017

In [14]:
#movie_gross_sorted_df['foreign_to_fix'] = [len(str(row)) <= 6 for row in movie_gross_sorted_df['foreign_gross']]
#movie_gross_sorted_df.loc[movie_gross_sorted_df['foreign_to_fix'], 'foreign_gross']

1872   1,131.60
3079   1,369.50
1873   1,019.40
1874   1,163.00
2760   1,010.00
         ...
2321        nan
2757        nan
2756        nan
1476        nan
327    3,800.00
Name: foreign_gross, Length: 1372, dtype: float64

In [15]:
#movie_gross_sorted_df.loc[movie_gross_sorted_df['foreign_to_fix'], 
 #                         'foreign_gross'] = movie_gross_sorted_df['foreign_gross'] * 1000000

In [56]:
movie_gross_sorted_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3387 entries, 1872 to 2825
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 158.8+ KB

In [57]:
movie_gross_sorted_df

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,"936,700,000.00","1,131.60",2015
3080,Black Panther,BV,"700,100,000.00","646,900,000.00",2018
3079,Avengers: Infinity War,BV,"678,800,000.00","1,369.50",2018
1873,Jurassic World,Uni.,"652,300,000.00","1,019.40",2015
727,Marvel's The Avengers,BV,"623,400,000.00","895,500,000.00",2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,nan,"49,600,000.00",2015
2392,Finding Mr. Right 2,CL,nan,"114,700,000.00",2016
2468,Solace,LGP,nan,"22,400,000.00",2016
2595,Viral,W/Dim.,nan,"552,000.00",2016
2825,Secret Superstar,NaN,nan,"122,000,000.00",2017

In [65]:
#pd.merge(basics_with_ratings_df, movie_gross_sorted_df, left_on='original_title', right_on='title' )

## Joining the Data

In [58]:
basics_ratings_gross_df = basics_with_ratings_df.join(movie_gross_sorted_df.set_index('title'), how='inner', on='title')
basics_ratings_gross_df

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year
38,tt0315642,Wazir,Wazir,2016,103.00,"Action,Crime,Drama",7.10,"15,378.00",Relbig.,"1,100,000.00",nan,2016
48,tt0337692,On the Road,On the Road,2012,124.00,"Adventure,Drama,Romance",6.10,"37,886.00",IFC,"744,000.00","8,000,000.00",2012
39490,tt2404548,On the Road,On the Road,2011,90.00,Drama,nan,nan,IFC,"744,000.00","8,000,000.00",2012
68078,tt3872966,On the Road,On the Road,2013,87.00,Documentary,nan,nan,IFC,"744,000.00","8,000,000.00",2012
76007,tt4339118,On the Road,On the Road,2014,89.00,Drama,6.00,6.00,IFC,"744,000.00","8,000,000.00",2012
...,...,...,...,...,...,...,...,...,...,...,...,...
133797,tt8404272,How Long Will I Love U,Chao shi kong tong ju,2018,101.00,Romance,6.50,607.00,WGUSA,"747,000.00","82,100,000.00",2018
134045,tt8427036,Helicopter Eela,Helicopter Eela,2018,135.00,Drama,5.40,673.00,Eros,"72,000.00",nan,2018
137854,tt8851262,Spring Fever,Spring Fever,2019,nan,"Comedy,Horror",nan,nan,Strand,"10,800.00","150,000.00",2010
140171,tt9078374,Last Letter,"Ni hao, Zhihua",2018,114.00,"Drama,Romance",6.40,322.00,CL,"181,000.00",nan,2018
140826,tt9151704,Burn the Stage: The Movie,Burn the Stage: The Movie,2018,84.00,"Documentary,Music",8.80,"2,067.00",Trafalgar,"4,200,000.00","16,100,000.00",2018

In [59]:
basics_ratings_gross_df.loc[135258]

movie_id                      tt8553606
title                            Aurora
original_title                   Aurora
start_year                         2019
runtime_minutes                  106.00
genres             Comedy,Drama,Romance
averagerating                      7.50
numvotes                         200.00
studio                             CGld
domestic_gross                 5,700.00
foreign_gross                  5,100.00
year                               2011
Name: 135258, dtype: object

In [60]:
basics_ratings_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3366 entries, 38 to 140826
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         3366 non-null   object
 1   title            3366 non-null   object
 2   original_title   3366 non-null   object
 3   start_year       3366 non-null   int64
 4   runtime_minutes  3198 non-null   float64
 5   genres           3326 non-null   object
 6   averagerating    3027 non-null   float64
 7   numvotes         3027 non-null   float64
 8   studio           3363 non-null   object
 9   domestic_gross   3342 non-null   float64
 10  foreign_gross    2043 non-null   float64
 11  year             3366 non-null   int64
dtypes: float64(5), int64(2), object(5)
memory usage: 501.9+ KB

In [61]:
df_without_nan = basics_ratings_gross_df.dropna()
df_without_nan

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year
48,tt0337692,On the Road,On the Road,2012,124.00,"Adventure,Drama,Romance",6.10,"37,886.00",IFC,"744,000.00","8,000,000.00",2012
76007,tt4339118,On the Road,On the Road,2014,89.00,Drama,6.00,6.00,IFC,"744,000.00","8,000,000.00",2012
96791,tt5647250,On the Road,On the Road,2016,121.00,Drama,5.70,127.00,IFC,"744,000.00","8,000,000.00",2012
54,tt0359950,The Secret Life of Walter Mitty,The Secret Life of Walter Mitty,2013,114.00,"Adventure,Comedy,Drama",7.30,"275,300.00",Fox,"58,200,000.00","129,900,000.00",2013
58,tt0365907,A Walk Among the Tombstones,A Walk Among the Tombstones,2014,114.00,"Action,Crime,Drama",6.50,"105,116.00",Uni.,"26,300,000.00","26,900,000.00",2014
...,...,...,...,...,...,...,...,...,...,...,...,...
126784,tt7752454,Detective Chinatown 2,Tang ren jie tan an 2,2018,121.00,"Action,Comedy,Mystery",6.10,"1,250.00",WB,"2,000,000.00","542,100,000.00",2018
127205,tt7784604,Hereditary,Hereditary,2018,127.00,"Drama,Horror,Mystery",7.30,"151,571.00",A24,"44,100,000.00","35,300,000.00",2018
130621,tt8097306,Nobody's Fool,Nobody's Fool,2018,110.00,"Comedy,Drama,Romance",4.60,"3,618.00",Par.,"31,700,000.00","1,800,000.00",2018
133797,tt8404272,How Long Will I Love U,Chao shi kong tong ju,2018,101.00,Romance,6.50,607.00,WGUSA,"747,000.00","82,100,000.00",2018
140826,tt9151704,Burn the Stage: The Movie,Burn the Stage: The Movie,2018,84.00,"Documentary,Music",8.80,"2,067.00",Trafalgar,"4,200,000.00","16,100,000.00",2018

In [62]:
df_without_nan['total_gross'] = df_without_nan['domestic_gross'] + df_without_nan['foreign_gross']
df_without_nan

<ipython-input-62-5c46eb2b29c7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_without_nan['total_gross'] = df_without_nan['domestic_gross'] + df_without_nan['foreign_gross']

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross
48,tt0337692,On the Road,On the Road,2012,124.00,"Adventure,Drama,Romance",6.10,"37,886.00",IFC,"744,000.00","8,000,000.00",2012,"8,744,000.00"
76007,tt4339118,On the Road,On the Road,2014,89.00,Drama,6.00,6.00,IFC,"744,000.00","8,000,000.00",2012,"8,744,000.00"
96791,tt5647250,On the Road,On the Road,2016,121.00,Drama,5.70,127.00,IFC,"744,000.00","8,000,000.00",2012,"8,744,000.00"
54,tt0359950,The Secret Life of Walter Mitty,The Secret Life of Walter Mitty,2013,114.00,"Adventure,Comedy,Drama",7.30,"275,300.00",Fox,"58,200,000.00","129,900,000.00",2013,"188,100,000.00"
58,tt0365907,A Walk Among the Tombstones,A Walk Among the Tombstones,2014,114.00,"Action,Crime,Drama",6.50,"105,116.00",Uni.,"26,300,000.00","26,900,000.00",2014,"53,200,000.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
126784,tt7752454,Detective Chinatown 2,Tang ren jie tan an 2,2018,121.00,"Action,Comedy,Mystery",6.10,"1,250.00",WB,"2,000,000.00","542,100,000.00",2018,"544,100,000.00"
127205,tt7784604,Hereditary,Hereditary,2018,127.00,"Drama,Horror,Mystery",7.30,"151,571.00",A24,"44,100,000.00","35,300,000.00",2018,"79,400,000.00"
130621,tt8097306,Nobody's Fool,Nobody's Fool,2018,110.00,"Comedy,Drama,Romance",4.60,"3,618.00",Par.,"31,700,000.00","1,800,000.00",2018,"33,500,000.00"
133797,tt8404272,How Long Will I Love U,Chao shi kong tong ju,2018,101.00,Romance,6.50,607.00,WGUSA,"747,000.00","82,100,000.00",2018,"82,847,000.00"
140826,tt9151704,Burn the Stage: The Movie,Burn the Stage: The Movie,2018,84.00,"Documentary,Music",8.80,"2,067.00",Trafalgar,"4,200,000.00","16,100,000.00",2018,"20,300,000.00"

In [63]:
df_without_nan.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1767 entries, 48 to 140826
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         1767 non-null   object
 1   title            1767 non-null   object
 2   original_title   1767 non-null   object
 3   start_year       1767 non-null   int64
 4   runtime_minutes  1767 non-null   float64
 5   genres           1767 non-null   object
 6   averagerating    1767 non-null   float64
 7   numvotes         1767 non-null   float64
 8   studio           1767 non-null   object
 9   domestic_gross   1767 non-null   float64
 10  foreign_gross    1767 non-null   float64
 11  year             1767 non-null   int64
 12  total_gross      1767 non-null   float64
dtypes: float64(6), int64(2), object(5)
memory usage: 193.3+ KB

In [64]:
# Attempting to sort by total_gross by DESC 

df_without_nan = df_without_nan.sort_values(by='total_gross', ascending=False)
df_without_nan.head(10)

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00"
19050,tt1825683,Black Panther,Black Panther,2018,134.00,"Action,Adventure,Sci-Fi",7.30,"516,148.00",BV,"700,100,000.00","646,900,000.00",2018,"1,347,000,000.00"
42223,tt2527336,Star Wars: The Last Jedi,Star Wars: Episode VIII - The Last Jedi,2017,152.00,"Action,Adventure,Fantasy",7.10,"462,903.00",BV,"620,200,000.00","712,400,000.00",2017,"1,332,600,000.00"
84414,tt4881806,Jurassic World: Fallen Kingdom,Jurassic World: Fallen Kingdom,2018,128.00,"Action,Adventure,Sci-Fi",6.20,"219,125.00",Uni.,"417,700,000.00","891,800,000.00",2018,"1,309,500,000.00"
6647,tt1323045,Frozen,Frozen,2010,93.00,"Adventure,Drama,Sport",6.20,"62,311.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
10824,tt1611845,Frozen,Wai nei chung ching,2010,92.00,"Fantasy,Romance",5.40,75.00,BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
35107,tt2294629,Frozen,Frozen,2013,102.00,"Adventure,Animation,Comedy",7.50,"516,998.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
62741,tt3606756,Incredibles 2,Incredibles 2,2018,118.00,"Action,Adventure,Animation",7.70,"203,510.00",BV,"608,600,000.00","634,200,000.00",2018,"1,242,800,000.00"
6453,tt1300854,Iron Man 3,Iron Man Three,2013,130.00,"Action,Adventure,Sci-Fi",7.20,"692,794.00",BV,"409,000,000.00","805,800,000.00",2013,"1,214,800,000.00"
35077,tt2293640,Minions,Minions,2015,91.00,"Adventure,Animation,Comedy",6.40,"193,917.00",Uni.,"336,000,000.00","823,400,000.00",2015,"1,159,400,000.00"

### Duplicate Titles in Data

In [65]:
df_without_nan.original_title.duplicated().sum()

156

In [66]:
# Set keep=False to view all duplicate rows to determine which record to keep

df_without_nan.loc[df_without_nan.original_title.duplicated(keep=False), :]

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross
6647,tt1323045,Frozen,Frozen,2010,93.00,"Adventure,Drama,Sport",6.20,"62,311.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
35107,tt2294629,Frozen,Frozen,2013,102.00,"Adventure,Animation,Comedy",7.50,"516,998.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
43781,tt2608638,Inside Out,Inside Out,2013,75.00,"Biography,Documentary,History",7.50,60.00,BV,"356,500,000.00","501,100,000.00",2015,"857,600,000.00"
27024,tt2071483,Inside Out,Inside Out,2011,59.00,Family,7.30,15.00,BV,"356,500,000.00","501,100,000.00",2015,"857,600,000.00"
28269,tt2096673,Inside Out,Inside Out,2015,95.00,"Adventure,Animation,Comedy",8.20,"536,181.00",BV,"356,500,000.00","501,100,000.00",2015,"857,600,000.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
133711,tt8396182,Aurora,Aurora,2018,98.00,Drama,6.30,7.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
62665,tt3603470,Aurora,Aurora,2014,83.00,Drama,7.00,87.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
135258,tt8553606,Aurora,Aurora,2019,106.00,"Comedy,Drama,Romance",7.50,200.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
7292,tt1403047,Aurora,Aurora,2010,181.00,Drama,6.70,"1,398.00",CGld,"5,700.00","5,100.00",2011,"10,800.00"
137581,tt8821182,Aurora,Aurora,2018,110.00,"Horror,Thriller",4.30,298.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"

In [67]:
movie_budgets_df = pd.read_csv('data/tn.movie_budgets.csv.gz')

In [68]:
# Attempt to sort by worldwide_gross

budgets_sorted_df = movie_budgets_df.sort_values(by='worldwide_gross', ascending=False)
budgets_sorted_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
3737,38,"Aug 21, 2009",Fifty Dead Men Walking,"$10,000,000",$0,"$997,921"
3432,33,"Sep 30, 2005",Duma,"$12,000,000","$870,067","$994,790"
5062,63,"Apr 1, 2011",Insidious,"$1,500,000","$54,009,150","$99,870,886"
883,84,"Apr 2, 2004",Hellboy,"$60,000,000","$59,623,958","$99,823,958"
5613,14,"Mar 21, 1980",Mad Max,"$200,000","$8,750,000","$99,750,000"
...,...,...,...,...,...,...
5488,89,"Dec 31, 2014",The Sound and the Shadow,"$500,000",$0,$0
5487,88,"Dec 1, 2015",Brooklyn Bizarre,"$500,000",$0,$0
5486,87,"Aug 11, 2015",Alleluia! The Devil's Carnival,"$500,000",$0,$0
5485,86,"Jun 23, 2015",Crossroads,"$500,000",$0,$0
4765,66,"Jan 15, 2013",30 Nights Of Paranormal Activity With The Devi...,"$3,000,000",$0,$0

In [69]:
budgets_sorted_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 3737 to 4765
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 316.2+ KB

## Working with Genres

In [70]:
df_without_nan

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00"
19050,tt1825683,Black Panther,Black Panther,2018,134.00,"Action,Adventure,Sci-Fi",7.30,"516,148.00",BV,"700,100,000.00","646,900,000.00",2018,"1,347,000,000.00"
42223,tt2527336,Star Wars: The Last Jedi,Star Wars: Episode VIII - The Last Jedi,2017,152.00,"Action,Adventure,Fantasy",7.10,"462,903.00",BV,"620,200,000.00","712,400,000.00",2017,"1,332,600,000.00"
84414,tt4881806,Jurassic World: Fallen Kingdom,Jurassic World: Fallen Kingdom,2018,128.00,"Action,Adventure,Sci-Fi",6.20,"219,125.00",Uni.,"417,700,000.00","891,800,000.00",2018,"1,309,500,000.00"
6647,tt1323045,Frozen,Frozen,2010,93.00,"Adventure,Drama,Sport",6.20,"62,311.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
133711,tt8396182,Aurora,Aurora,2018,98.00,Drama,6.30,7.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
62665,tt3603470,Aurora,Aurora,2014,83.00,Drama,7.00,87.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
135258,tt8553606,Aurora,Aurora,2019,106.00,"Comedy,Drama,Romance",7.50,200.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"
7292,tt1403047,Aurora,Aurora,2010,181.00,Drama,6.70,"1,398.00",CGld,"5,700.00","5,100.00",2011,"10,800.00"
137581,tt8821182,Aurora,Aurora,2018,110.00,"Horror,Thriller",4.30,298.00,CGld,"5,700.00","5,100.00",2011,"10,800.00"

In [71]:
df_without_nan['list_of_genres'] = df_without_nan['genres'].map(lambda x: x.split(','))
df_without_nan

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross,list_of_genres
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00","[Action, Adventure, Sci-Fi]"
19050,tt1825683,Black Panther,Black Panther,2018,134.00,"Action,Adventure,Sci-Fi",7.30,"516,148.00",BV,"700,100,000.00","646,900,000.00",2018,"1,347,000,000.00","[Action, Adventure, Sci-Fi]"
42223,tt2527336,Star Wars: The Last Jedi,Star Wars: Episode VIII - The Last Jedi,2017,152.00,"Action,Adventure,Fantasy",7.10,"462,903.00",BV,"620,200,000.00","712,400,000.00",2017,"1,332,600,000.00","[Action, Adventure, Fantasy]"
84414,tt4881806,Jurassic World: Fallen Kingdom,Jurassic World: Fallen Kingdom,2018,128.00,"Action,Adventure,Sci-Fi",6.20,"219,125.00",Uni.,"417,700,000.00","891,800,000.00",2018,"1,309,500,000.00","[Action, Adventure, Sci-Fi]"
6647,tt1323045,Frozen,Frozen,2010,93.00,"Adventure,Drama,Sport",6.20,"62,311.00",BV,"400,700,000.00","875,700,000.00",2013,"1,276,400,000.00","[Adventure, Drama, Sport]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
133711,tt8396182,Aurora,Aurora,2018,98.00,Drama,6.30,7.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",[Drama]
62665,tt3603470,Aurora,Aurora,2014,83.00,Drama,7.00,87.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",[Drama]
135258,tt8553606,Aurora,Aurora,2019,106.00,"Comedy,Drama,Romance",7.50,200.00,CGld,"5,700.00","5,100.00",2011,"10,800.00","[Comedy, Drama, Romance]"
7292,tt1403047,Aurora,Aurora,2010,181.00,Drama,6.70,"1,398.00",CGld,"5,700.00","5,100.00",2011,"10,800.00",[Drama]
137581,tt8821182,Aurora,Aurora,2018,110.00,"Horror,Thriller",4.30,298.00,CGld,"5,700.00","5,100.00",2011,"10,800.00","[Horror, Thriller]"

In [72]:
genres_df = df_without_nan.explode('list_of_genres')
genres_df

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year,total_gross,list_of_genres
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00",Action
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00",Adventure
39010,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.00,"Action,Adventure,Sci-Fi",7.30,"665,594.00",BV,"459,000,000.00","946,400,000.00",2015,"1,405,400,000.00",Sci-Fi
19050,tt1825683,Black Panther,Black Panther,2018,134.00,"Action,Adventure,Sci-Fi",7.30,"516,148.00",BV,"700,100,000.00","646,900,000.00",2018,"1,347,000,000.00",Action
19050,tt1825683,Black Panther,Black Panther,2018,134.00,"Action,Adventure,Sci-Fi",7.30,"516,148.00",BV,"700,100,000.00","646,900,000.00",2018,"1,347,000,000.00",Adventure
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
135258,tt8553606,Aurora,Aurora,2019,106.00,"Comedy,Drama,Romance",7.50,200.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",Drama
135258,tt8553606,Aurora,Aurora,2019,106.00,"Comedy,Drama,Romance",7.50,200.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",Romance
7292,tt1403047,Aurora,Aurora,2010,181.00,Drama,6.70,"1,398.00",CGld,"5,700.00","5,100.00",2011,"10,800.00",Drama
137581,tt8821182,Aurora,Aurora,2018,110.00,"Horror,Thriller",4.30,298.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",Horror
137581,tt8821182,Aurora,Aurora,2018,110.00,"Horror,Thriller",4.30,298.00,CGld,"5,700.00","5,100.00",2011,"10,800.00",Thriller

### Groupby List of Genres

In [73]:
genres_grouped = genres_df.groupby('list_of_genres').sum()
genres_grouped

,start_year,runtime_minutes,averagerating,numvotes,domestic_gross,foreign_gross,year,total_gross
list_of_genres,,,,,,,,
Action,922381,"52,678.00","2,935.40","76,340,878.00","37,674,384,196.00","67,760,212,558.90",922408,"105,434,596,754.90"
Adventure,741176,"40,980.00","2,399.50","68,114,087.00","41,532,854,795.00","77,785,294,086.90",741217,"119,318,148,881.90"
Animation,245687,"11,687.00",813.70,"12,740,525.00","13,214,310,498.00","25,163,917,999.00",245725,"38,378,228,497.00"
Biography,322286,"18,567.00","1,122.90","15,478,966.00","5,538,161,799.00","7,251,920,400.00",322315,"12,790,082,199.00"
Comedy,1206035,"62,449.00","3,761.80","49,283,963.00","30,759,544,795.00","45,497,069,797.00",1206125,"76,256,614,592.00"
Crime,487224,"26,938.00","1,573.70","25,895,312.00","8,908,928,700.00","9,866,646,072.00",487263,"18,775,574,772.00"
Documentary,165104,"6,836.00",580.20,"592,530.00","2,659,038,899.00","3,161,341,500.00",165083,"5,820,380,399.00"
Drama,1874503,"104,288.00","6,189.40","71,723,014.00","26,720,567,297.00","39,279,903,592.00",1874686,"66,000,470,889.00"
Family,169102,"8,590.00",516.80,"5,612,613.00","5,446,805,300.00","8,284,801,300.00",169095,"13,731,606,600.00"
Fantasy,257743,"14,210.00",795.20,"17,202,422.00","9,010,959,899.00","18,440,349,700.00",257763,"27,451,309,599.00"
History,161121,"9,366.00",547.50,"5,118,330.00","2,347,847,098.00","3,203,832,399.00",161148,"5,551,679,497.00"
Horror,314178,"15,210.00",899.30,"11,699,967.00","6,334,585,600.00","8,652,531,300.00",314180,"14,987,116,900.00"
Music,98664,"5,206.00",324.30,"3,320,977.00","1,479,130,200.00","2,019,816,000.00",98665,"3,498,946,200.00"
Musical,18120,"1,085.00",55.00,"430,437.00","416,549,000.00","656,085,300.00",18122,"1,072,634,300.00"
Mystery,265799,"14,020.00",823.00,"15,933,705.00","4,712,750,600.00","7,045,372,598.00",265813,"11,758,123,198.00"
News,2014,52.00,6.40,8.00,"21,400,000.00","43,200,000.00",2011,"64,600,000.00"
Romance,511263,"27,601.00","1,620.00","15,331,997.00","6,682,463,499.00","8,858,824,895.00",511310,"15,541,288,394.00"
Sci-Fi,227575,"13,148.00",741.00,"32,704,815.00","14,946,481,299.00","23,672,543,388.90",227580,"38,619,024,687.90"
Sport,68476,"3,926.00",235.40,"2,444,498.00","2,004,630,700.00","2,113,002,500.00",68476,"4,117,633,200.00"
Thriller,579885,"31,186.00","1,800.60","32,999,436.00","12,929,952,400.00","21,366,218,669.00",579925,"34,296,171,069.00"
War,38250,"2,215.00",131.10,"599,389.00","201,082,800.00","365,316,000.00",38256,"566,398,800.00"
Western,22131,"1,249.00",70.80,"1,916,482.00","481,339,100.00","688,323,000.00",22132,"1,169,662,100.00"

In [74]:
genres_grouped.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22 entries, Action to Western
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   start_year       22 non-null     int64
 1   runtime_minutes  22 non-null     float64
 2   averagerating    22 non-null     float64
 3   numvotes         22 non-null     float64
 4   domestic_gross   22 non-null     float64
 5   foreign_gross    22 non-null     float64
 6   year             22 non-null     int64
 7   total_gross      22 non-null     float64
dtypes: float64(6), int64(2)
memory usage: 1.5+ KB